<template>
    <div>
        <div class="h2">Наши услуги</div>
        <p class="card-category">Выберите подходящую услугу</p>

        <template v-for="(serviceType, serviceKey) in services">
            <card :title="translate(serviceKey)">
                <div class="row">
                    <div v-for="service in serviceType"
                         class="col-lg-2">
                        <div class="service-item"
                             @click="openInfo(service)">
                            <div class="service-img">
                                <img :src="service.imgUrl"
                                     :alt="service.name"
                                     class="service-img-item">
                            </div>
                        </div>
                    </div>
                </div>
            </card>
        </template>

        <el-dialog :visible.sync="dialogVisible">
            <div class="service-info-wrapper">
                <div class="service-info-main">
                    <div class="service-info-img">
                        <img :src="dialogContent.imgUrl"
                             :alt="dialogContent.name">
                    </div>
                    <div class="service-info-main-text">
                        <div class="h4">{{dialogContent.name}}</div>
                        <p>{{dialogContent.description}}</p>
                        <div class="service-price">Цена: <span>{{dialogContent.price}} руб.</span></div>
                    </div>
                </div>
                <hr>
                <div class="service-info-body">
                    <div class="h5">Перечень оказываемых услуг</div>
                    <ol class="custom-ol">
                        <li v-for="listItem in dialogContent.serviceList">{{listItem}}</li>
                    </ol>
                </div>
                <hr>
                <div class="service-info-additional">
                    <div class="h5">Дополнительные услуги</div>
                    <div class="row">
                        <div v-for="additionalService in dialogContent.additionalServices"
                             class="col-lg-4">
                            <checkbox v-model="additionalService.active">{{additionalService.name}} ({{additionalService.price}}руб)</checkbox>
                        </div>
                    </div>
                </div>
                <hr>
                <div class="service-confirm-footer">
                    <div class="service-total">Итого: <span>{{totalPrice}} руб.</span></div>
                    <div class="service-confirm-btn">
                        <l-button type="success">Оформить услугу</l-button>
                    </div>
                </div>
            </div>
        </el-dialog>

    </div>
</template>

<script>

    import {Dialog} from 'element-ui'
    import {Checkbox, Radio} from 'src/components/index'

  export default {
    components: {
      [Dialog.name]: Dialog,
      Checkbox,
      Radio
    },
    data() {
      return {
        services: {
          standart: [
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 50000,
              imgUrl: 'static/img/service.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 50000,
              imgUrl: 'static/img/service.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 50000,
              imgUrl: 'static/img/service.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 50000,
              imgUrl: 'static/img/service.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 50000,
              imgUrl: 'static/img/service.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 50000,
              imgUrl: 'static/img/service.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
          ],
          premium: [
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 150000,
              imgUrl: 'static/img/service-2.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 150000,
              imgUrl: 'static/img/service-2.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 150000,
              imgUrl: 'static/img/service-2.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 150000,
              imgUrl: 'static/img/service-2.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 150000,
              imgUrl: 'static/img/service-2.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 150000,
              imgUrl: 'static/img/service-2.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
          ],
          vip: [
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 500000,
              imgUrl: 'static/img/service-3.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 500000,
              imgUrl: 'static/img/service-3.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 500000,
              imgUrl: 'static/img/service-3.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 500000,
              imgUrl: 'static/img/service-3.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 500000,
              imgUrl: 'static/img/service-3.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
            {
              name: 'Сертификат на оказание ритуальных услуг',
              price: 500000,
              imgUrl: 'static/img/service-3.jpg',
              description: 'Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий способствует подготовки и реализации соответствующий условий активизации. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.',
              serviceList: [
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)',
                'Место захоронения (Без выбора кладбища)'
              ],
              additionalServices: [
                {
                  name: 'Дополнительная услуга #1',
                  price: 20000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #2',
                  price: 25000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #3',
                  price: 30000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #4',
                  price: 35000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #5',
                  price: 40000,
                  active: false
                },
                {
                  name: 'Дополнительная услуга #6',
                  price: 45000,
                  active: false
                },
              ]
            },
          ]
        },
        dialogVisible: false,
        dialogContent: {}
      }
    },
    computed: {
      totalPrice() {
        let totalPrice = this.dialogContent.price
        if ( this.dialogContent.additionalServices != undefined ) {
          this.dialogContent.additionalServices.forEach(additionalService => {
            if ( additionalService.active == true ) {
              totalPrice += additionalService.price
            }
          })
        }
        return totalPrice
      }
    },
    methods: {
      translate(string) {
        switch (string) {
          case 'standart':
            return 'Стандартные сертификаты'
          case 'premium':
            return 'Премиум сертификаты'
          case 'vip':
            return 'VIP сертификаты'
        }
      },
      openInfo(item) {
        this.dialogVisible = true
        this.dialogContent = item
      },
    }
  }

</script>
<style>

    .service-img-item {
        width: 100%;
        transition: all .3s ease;
    }
    .service-item {
        margin-bottom: 30px;
    }

</style>
